### missing data -> like remove and fill

In [2]:
import numpy as np
import pandas as pd

In [6]:
data = {
    'Name': ['Alice', 'Bob', 'Charlie', np.nan],
    'Age': [25, np.nan, 35, 40],
    'City': ['New York', 'Los Angeles', np.nan, 'Houston']
}

df = pd.DataFrame(data)
print(df);

      Name   Age         City
0    Alice  25.0     New York
1      Bob   NaN  Los Angeles
2  Charlie  35.0          NaN
3      NaN  40.0      Houston

In [ ]:
df.isna().sum() # search isna

Name    1
Age     1
City    1
dtype: int64

In [9]:
df.dropna()

    Name   Age      City
0  Alice  25.0  New York

In [15]:
df.dropna(thresh=3)

    Name   Age      City
0  Alice  25.0  New York

## Filling the missing data

In [16]:
df.fillna(0)

      Name   Age         City
0    Alice  25.0     New York
1      Bob   0.0  Los Angeles
2  Charlie  35.0            0
3        0  40.0      Houston

In [17]:
df

      Name   Age         City
0    Alice  25.0     New York
1      Bob   NaN  Los Angeles
2  Charlie  35.0          NaN
3      NaN  40.0      Houston

In [20]:
value = {'Name':'somay','Age':25,'City':'alwar'};

df.fillna(value=value)

      Name   Age         City
0    Alice  25.0     New York
1      Bob  25.0  Los Angeles
2  Charlie  35.0        alwar
3    somay  40.0      Houston

In [25]:
# df.fillna(df.mean('Age'));